In [14]:
import pandas as pd

data = pd.read_csv("Salary_Data.csv")

In [15]:
data.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [ ]:
#Catatan :
#data yang ebrupa tulisan (object) tidak bisa dipakai untuk algoritma machine learning, jadi harus dilakukan transformasi
#yaitu mengganti nilai huruf menjadi angka

In [ ]:
#x1 = Age
#x2 = Gender
#x3 = Education
#x4 = Job Title
#x5 = Years of Experience

#y = Salary

In [16]:
data.dtypes

Age                    float64
Gender                  object
Education Level         object
Job Title               object
Years of Experience    float64
Salary                 float64
dtype: object

# Preprocessing Data

In [17]:
#Jika ada kolom yang tipe datanya categorical (tulisan dsb / bukan angka) maka kolom tersebut 
#harus diconvert menjadi angka dengan metod encoder

#merubah semua kolom kategorical menjadi numerical
from sklearn.preprocessing import LabelEncoder
# Mendeteksi kolom kategori
categorical_cols = data.select_dtypes(include=['object']).columns

# Membuat objek LabelEncoder
label_encoders = {}

# Mengubah kolom kategori menjadi numerik
for col in categorical_cols:
    label_encoders[col] = LabelEncoder()
    data[col] = label_encoders[col].fit_transform(data[col])

In [18]:
#penegecekan kembali data setelah diconvert menjadi angka
data.head()

#sehingga menjadi misalnya
#gender : male = 1, female = 0

    Age  Gender  Education Level  Job Title  Years of Experience    Salary
0  32.0       1                0        177                  5.0   90000.0
1  28.0       0                3         18                  3.0   65000.0
2  45.0       1                5        145                 15.0  150000.0
3  36.0       0                0        116                  7.0   60000.0
4  52.0       1                3         26                 20.0  200000.0

In [19]:
#step selanjutnya cek apakah ada null value atau NaN atau tidak
#jika ada berarti Nilai NaN atau null harus diganti dnegan nilai tertentu (boleh mean, median, modus)
data.isna().sum()

Age                    2
Gender                 0
Education Level        0
Job Title              0
Years of Experience    3
Salary                 5
dtype: int64

In [38]:
#data null atau Nan harus diisi dengan nilai tertentu (mean) dengan metode fillna
data['Age'].fillna(data['Age'].mean(), inplace=True)
data['Years of Experience'].fillna(data['Years of Experience'].mean(), inplace=True)
data['Salary'].fillna(data['Salary'].mean(), inplace=True)

C:\Users\ACER\AppData\Local\Temp\ipykernel_15220\1229211688.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Age'].fillna(data['Age'].mean(), inplace=True)
C:\Users\ACER\AppData\Local\Temp\ipykernel_15220\1229211688.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Years of Experience'].fillna(data['Years of Experience'].mean(), inplace=True)
C:\Users\ACER\AppData\Local\Temp\ipykernel_15220\1229211688.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Salary'].fillna(data['Salary'].mean(), inplace=True)

In [21]:
#cek kembali apakah masih ada null atau nilai nan
data.isna().sum()

Age                    0
Gender                 0
Education Level        0
Job Title              0
Years of Experience    0
Salary                 0
dtype: int64

# Aplikasikan Algoritma Machine Learning

In [22]:
#bagi data menjadi variabel X dan Y

x = data.iloc[:, [0,1,2,3,4]].values
y = data.iloc[:, [5]].values

In [25]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression #Y= aX + B
from sklearn.metrics import mean_squared_error #menghitung error yang didapatkan dari model ML ((Ysebenarnya^2-Yprediksi^2)/banyak data)1/2

In [32]:
# Split data into train and test sets
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size=0.25, random_state=42) #80% dijadikan data training, 20% testing

# Instantiate the model
model = LinearRegression()

# Train the model
model.fit(X_train, y_train)

# Make predictions
y_pred = model.predict(X_test) #prediksi nilai temperatur

# Evaluate the model
mse = mean_squared_error(y_test, y_pred) 
print("Mean Squared Error:", mse)

Mean Squared Error: 904902593.3579634

In [37]:
prediksi = model.predict([[32,1,0,177,4]]) #predict one array only 

print("hasil prediksi salary", (round(prediksi[0][0]),2))

hasil prediksi salary (76536, 2)